---
kind: other
id: Properties.T:Autodesk.Revit.DB.DGNImportOptions
source: html/150f3309-1942-068c-b81d-e3433e95c0ad.htm
---
# DGNImportOptions Properties

Correct almost-vertical lines and almost-horizontal lines for import model
 if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.